// © Copyright 2004-2010, 2015 HP Development Company, L.P.

TaskName = "Oppdater fastvare";

// Errors
FileOpenError = "Kan ikke åpne filen %@";
FileOpenErrorExplanation = "Denne filen er ødelagt, flyttet til et annet sted, fått nytt navn eller slettet. Kontroller filplassering eller velg en annen fil og prøv igjen";
PrintChannelOpenError = "Kan ikke åpne en skriverkanal";
PrintChannelOpenErrorExplanation = "Kontroller om skriveren er slått på og koblet til, og prøv senere.";
SendDataError = "Kan ikke sende data til skriveren";
SendDataErrorExplanation = "Kontroller om skriveren er slått på og koblet til, og prøv senere.";

SomePenErrorTitle = "Kan ikke oppdatere fastvare";
DoorOpenMsg = "Kan ikke oppdatere fastvaren fordi et deksel er åpent. Lukk alle dekslene på skriveren.";

// Aquamarine Errors
FileCheckError = "Kan ikke oppdatere fastvare";
FileCheckErrorExplanation = "Fastvarepakken er ikke gyldig. Velg en annen fil og prøv igjen.";

OkButton = "Ok";
CancelButton = "Avbryt";
FirmwareUpdateTitle = "Fastvareoppdatering";
FirmwareUpdateDeviceState = "Skriver ut";
FirmwareUpdateCancelingDeviceState = "Avbryter";

// Great Wall Messages
PrinterIdleWarning = "Det kan hende fastvareoppdateringen mislykkes hvis skriveren er opptatt (for eksempel at den skriver ut en jobb eller kalibrerer).\n\nKontroller at skriveren er ledig før du fortsetter med fastvareoppdateringsprosessen.";
UpdateSuccessful = "Fastvarefilen er overført og skriveren oppdateres.\n\nNår fastvareoppdateringen er fullført, startes skriveren automatisk på nytt.";
InvalidPackage = "Det oppsto problemer med fastvarefilen, og fastvareoppdateringsprosessen er ikke fullført. Problemet kan skyldes en overføringsfeil.\n\nPrøv å starte fastvareoppdateringsprosessen på nytt.\nHvis problemet vedvarer, ta kontakt med HP-støtte.";
FailedDependencies = "Fastvareoppdateringsprossesen kunne ikke fullføres på grunn av et avhengighetsproblem.\n\nDen nåværende fastvareversjonen er %@, og du prøver å installere %@.\n\nGå til den følgende nettsiden for å finne den riktige oppdateringspakken for denne skriveren:\n%@.";
NotNow = "Fastvareoppdateringen er ikke fullført fordi skriveren er opptatt (for eksempel med å behandle eller skrive ut en jobb).\n\nKontroller at skriveren er ledig og utfør fastvareoppdateringen på nytt.";
TransmissionError = "Det oppsto problemer med overføringen som førte til at fastvareoppdateringen ikke ble fullført.\n\nKontroller forbindelsen til skriveren og utfør fastvareoppdateringen på nytt.";
LicenseNotAccepted = "Fastvareoppdateringen er ikke fullført fordi lisensen ikke ble godtatt.";
FatalError = "Det oppsto problemer som gjorde at fastvareoppdateringsprossesen ikke kunne fullføres.\n\nHvis problemet vedvarer, ta kontakt med HP-støtte.";

// layout
TaskTitle = "Oppdater fastvare";
TaskDescription = "Velg en fil som inneholder fastvareoppdatering og overfør filen til skriveren for å oppdatere den.";
FileNameTitle = "Filnavn:";
FileNameField = "<Ikke valgt>";
ChooseButton = "Velg…";
UpdateButton = "Oppdater";
ProgressPanel = "Fremdrift for oppdatering";
FirmwareUpdateProcessTitle = "Oppdaterer…";
